{"config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 512, 512, 3], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d", "class_name": "Conv2D", "config": {"dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "conv2d", "strides": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 16}}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "name": "max_pooling2d", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "seed": null, "rate": 0.25, "name": "dropout", "noise_shape": null}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 32}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 64}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_2", "noise_shape": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "flatten", "class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense", "class_name": "Dense", "config": {"dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 512, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu"}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "sigmoid"}}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}